programming/book/the_c_programming_language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The C Programming Language</title>
<!-- 2016-10-26 周三 20:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">The C Programming Language</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Preface to the First Edition</a></li>
<li><a href="#sec-2">2. Chapter 1: A Tutorial Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1. Character Input and Output</a></li>
<li><a href="#sec-2-2">2.2. Arguments - Call by Value</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Chapter 2: Types, Operators and Expressions</a>
<ul>
<li><a href="#sec-3-1">3.1. Variable Names</a></li>
<li><a href="#sec-3-2">3.2. Arithmetic Operators</a></li>
<li><a href="#sec-3-3">3.3. Type Conversions</a></li>
<li><a href="#sec-3-4">3.4. Precedence and Order of Evaluation</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Chapter 3: Control Flow</a>
<ul>
<li><a href="#sec-4-1">4.1. Loops - <code>while</code> and <code>for</code></a></li>
<li><a href="#sec-4-2">4.2. <code>goto</code> and Labels</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Chapter 4: Functions and Program Structure</a>
<ul>
<li><a href="#sec-5-1">5.1. Basics of Functions</a></li>
<li><a href="#sec-5-2">5.2. Functions Returning Non-integers</a></li>
<li><a href="#sec-5-3">5.3. External Variables</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Chapter 5</a>
<ul>
<li><a href="#sec-6-1">6.1. Pointers to Functions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preface to the First Edition</h2>
<div class="outline-text-2" id="text-1">
<p>
C is not a "very high level" language, nor a "big" one, and is not specialized to any particular area of application.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Chapter 1: A Tutorial Introduction</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Character Input and Output</h3>
<div class="outline-text-3" id="text-2-1">
<p>
A text stream is a sequence of characters divided into lines; each line consists of zero or more characters followed by a newline character.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Arguments - Call by Value</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Call by value is an asset, however, not a liability. It usually leads to more compact programs with fewer extraneous variables, because parameters can be treated as conveniently initialized local variables in the called routine.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Chapter 2: Types, Operators and Expressions</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Variable Names</h3>
<div class="outline-text-3" id="text-3-1">
<p>
At least the first 31 characters of an internal name are significant. For function names and external variables, the number may be less than 31, because external names may be used by assemblers and loaders over which the language has no control. For external names, the standard guarantees uniqueness only for 6 characters and a single case. 
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Arithmetic Operators</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The direction of truncation for <code>/</code> and the sign of the result for <code>%</code> are machine-dependent for negative operands, as is the action taken on overflow or underflow.
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Type Conversions</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Comparisons between signed and unsigned values are machine-dependent, because they
depend on the sizes of the various integer types.
</p>

<p>
When a <code>double</code> is converted to <code>float</code>, whether the value is rounded or truncated is implementation dependent.
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Precedence and Order of Evaluation</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<span class="underline">Function calls, nested assignment statements, and increment and decrement operators</span> cause "side effects" ĄŞ some <span class="underline">variable is changed as a by-product of the evaluation</span> of an expression.
</p>

<p>
One unhappy situation is typified by the statement <code>a[i] = i++</code>, compilers can interpret this in different ways.
</p>

<p>
The moral is that <span class="underline">writing code that depends on order of evaluation is a bad programming practice in any language</span>. 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Chapter 3: Control Flow</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Loops - <code>while</code> and <code>for</code></h3>
<div class="outline-text-3" id="text-4-1">
<p>
Shell sort: the basic idea of this sorting algorithm is that in early stages, far-apart elements are compared, rather than adjacent ones as in simpler interchange sorts. This tends to eliminate large amounts of disorder quickly, so later stages have less work to do. The interval between compared elements is gradually decreased to one.
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">shellsort</span>(<span class="org-type">int</span> <span class="org-variable-name">v</span>[], <span class="org-type">int</span> <span class="org-variable-name">n</span>)
{
    <span class="org-type">int</span> <span class="org-variable-name">gap</span>, <span class="org-variable-name">i</span>, <span class="org-variable-name">j</span>, <span class="org-variable-name">temp</span>;
    <span class="org-keyword">for</span> (gap = n/2; gap &gt; 0; gap /= 2)
        <span class="org-keyword">for</span> (i = gap; i &lt; n; i++)
            <span class="org-keyword">for</span> (j = i-gap; j &gt;= 0 &amp;&amp; v[j] &gt; v[j+gap]; j -= gap) {
                temp = v[j];
                v[j] = v[j+gap];
                v[j+gap] = temp;
            }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <code>goto</code> and Labels</h3>
<div class="outline-text-3" id="text-4-2">
<p>
C provides the infinitely-abusable <code>goto</code> statement, and labels to branch to.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Chapter 4: Functions and Program Structure</h2>
<div class="outline-text-2" id="text-5">
<p>
A program may reside in one or more source files. Source files may be <span class="underline">compiled separately and loaded together</span>, along with previously compiled functions from libraries.
</p>

<p>
The ANSI standard requires that there be only one definition of each external object.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Basics of Functions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
If a function fails to return a value, its "value" is certain to be garbage.
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Functions Returning Non-integers</h3>
<div class="outline-text-3" id="text-5-2">
<p>
If <code>atof</code> itself and the call to it in <code>main</code> have inconsistent types in the same source file, the error will be detected by the compiler. But if <code>atof</code> were compiled separately, the mismatch would not be detected, <code>atof</code> would return a <code>double</code> that <code>main</code> would treat as an <code>int</code>, and meaningless answers would result.
</p>

<p>
If a name that has not been previously declared occurs in an expression and is followed by a left parentheses, it is declared by context to be a function name, the function is assumed to return an <code>int</code>, and nothing is assumed about its arguments. Furthermore, if a function declaration does not include arguments, that too is taken to mean that nothing is to be assumed about the arguments; all parameter checking is turned off.
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> External Variables</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Reverse Polish notation: Each operand is pushed onto a stack; when an operator arrives, the proper number of operands (two for binary operators) is popped, the operator is applied to them, and the result is pushed back onto the stack.
</p>

<div class="org-src-container">
<label class="org-src-name">Reverse Polish calculator</label>
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdlib.h&gt;</span>

<span class="org-preprocessor">#define</span> <span class="org-variable-name">MAXOP</span> 100  <span class="org-comment-delimiter">// </span><span class="org-comment">Max size of operand or operator</span>
<span class="org-preprocessor">#define</span> <span class="org-variable-name">NUMBER</span> <span class="org-string">'0'</span> <span class="org-comment-delimiter">// </span><span class="org-comment">signal that a number was found</span>

<span class="org-type">int</span> <span class="org-function-name">getop</span>(<span class="org-type">char</span> []);
<span class="org-type">void</span> <span class="org-function-name">push</span>(<span class="org-type">double</span>);
<span class="org-type">double</span> <span class="org-function-name">pop</span>(<span class="org-type">void</span>);

<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
    <span class="org-type">int</span> <span class="org-variable-name">type</span>;
    <span class="org-type">double</span> <span class="org-variable-name">op2</span>;
    <span class="org-type">char</span> <span class="org-variable-name">s</span>[MAXOP];

    <span class="org-keyword">while</span> ((type = getop(s)) != EOF) {
        <span class="org-keyword">switch</span> (type) {
            <span class="org-keyword">case</span> NUMBER:
                push(atof(s));
                <span class="org-keyword">break</span>;
            <span class="org-keyword">case</span> <span class="org-string">'+'</span>:
                push(pop() + pop());
                <span class="org-keyword">break</span>;
            <span class="org-keyword">case</span> <span class="org-string">'*'</span>:
                push(pop() * pop());
                <span class="org-keyword">break</span>;
            <span class="org-keyword">case</span> <span class="org-string">'-'</span>:
                op2 = pop();
                push(pop() - op2);
                <span class="org-keyword">break</span>;
            <span class="org-keyword">case</span> <span class="org-string">'/'</span>:
                op2 = pop();
                <span class="org-keyword">if</span> (op2 != 0.0)
                    push(pop() / op2);
                <span class="org-keyword">else</span>
                    printf(<span class="org-string">"error: zero divisor\n"</span>);
                <span class="org-keyword">break</span>;
            <span class="org-keyword">case</span> <span class="org-string">'\n'</span>:
                printf(<span class="org-string">"\t%.8g\n"</span>, pop());
                <span class="org-keyword">break</span>;
            <span class="org-keyword">default</span>:
                printf(<span class="org-string">"error: unknown command %s\n"</span>, s);
                <span class="org-keyword">break</span>;
        }
    }
    <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Chapter 5</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Pointers to Functions</h3>
<div class="outline-text-3" id="text-6-1">
<p>
A sort often consists of three parts:
</p>

<ul class="org-ul">
<li>a comparison that determines the ordering of any pair of objects
</li>
<li>an exchange that reverses their order
</li>
<li>a sorting algorithm that makes comparisons and exchanges until the objects are in order
</li>
</ul>

<p>
The sorting algorithm is independent of the comparison and exchange operations, so by passing different comparison and exchange functions to it, we can arrange to sort by different criteria.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-10-26 周三 20:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
